; domain
(define (domain healthcare)
  (:requirements :strips :typing :fluents)

  (:types
    medical_unit inventory - location
    scissor band_aid syringes - content
    terrestrial_robot arial_robot - robot
    delivery_robot accompany_robot - terrestrial_robot
    drone - arial_robot
    carrier - box
    patient
  )

  (:predicates
    (robot_at ?r - robot ?l - location)
    (contains ?b - box ?c - content)
    (carrier_load ?c - carrier ?b - box)
    (carrier_at ?c - carrier ?l - location)
    (robot_has_carrier ?r - robot ?c - carrier) ;; The non delivery robot must be distinguished by the problem
    (connected ?l1 - location ?l2 - location)
    (has_drone_port ?l - location)
    (at_box ?b - box ?l - location)

    ;; patient management
    (free_to_accompany ?r - accompany_robot)
    (accompanying_pat ?p - patient ?ar - accompany_robot)
    (patient_at ?p - patient ?l - location)
  )

  (:functions
    (carrier_capacity ?c - carrier)
    (carrier_used ?c - carrier)
    (med_unit_inventory_of ?m - medical_unit ?c - content)
    (warehouse_inventory_of ?i - location ?c - content)
  )
;;----------------------- TERRESTRIAL ROBOTS
  ;; Moving a robot
  (:action move
    :parameters (?r - terrestrial_robot ?from - location ?to - location)
    :precondition (and (robot_at ?r ?from) (connected ?from ?to))
    :effect (and (not (robot_at ?r ?from)) (robot_at ?r ?to))
  )
  ;;-------------------------------------------DELIVERY ROBOT
  ;; Load a box into the carrier of the robot
  (:action load_to_robot_carrier
    :parameters (?r - delivery_robot ?b - box ?c - carrier ?l - inventory)
    :precondition (and (robot_at ?r ?l) (robot_has_carrier ?r ?c) (carrier_at ?c ?l) (at_box ?b ?l)
      (< (carrier_used ?c) (carrier_capacity ?c)))
    :effect (and (not (at_box ?b ?l)) (carrier_load ?c ?b) (increase (carrier_used ?c) 1))
  )

  ;; Unload a box from the carrier
  (:action unload_from_robot_carrier
    :parameters (?r - delivery_robot ?b - box ?c - carrier ?l - location)
    :precondition (and (robot_at ?r ?l) (robot_has_carrier ?r ?c) (carrier_load ?c ?b))
    :effect (and (at_box ?b ?l) (not (carrier_load ?c ?b)) (decrease (carrier_used ?c) 1))
  )

  ;; Move robot along with its carrier
  (:action move_with_carrier
    :parameters (?r - delivery_robot ?c - carrier ?from - location ?to - location)
    :precondition (and (robot_at ?r ?from) (carrier_at ?c ?from) (robot_has_carrier ?r ?c) (connected ?from ?to))
    :effect (and (not (carrier_at ?c ?from)) (carrier_at ?c ?to)
      (not (robot_at ?r ?from)) (robot_at ?r ?to))
  )


  ;; Unload content at a medical unit
  (:action unload_content
    :parameters (?r - delivery_robot ?b - box ?m - medical_unit ?c - content)
    :precondition (and (robot_at ?r ?m) (at_box ?b ?m) (contains ?b ?c))
    :effect (and (not (contains ?b ?c)) (increase (med_unit_inventory_of ?m ?c) 1))
  )

  ;;------------------------------------------------ DRONE CAPABILITIES
  ;; Load a box into a drone
  (:action load_to_drone_carrier
    :parameters (?d - drone ?b - box ?c - carrier ?l - location)
    :precondition (and (robot_at ?d ?l) (robot_has_carrier ?d ?c) (carrier_at ?c ?l) (at_box ?b ?l)
      (< (carrier_used ?c) (carrier_capacity ?c)))
  
    :effect (and (not (at_box ?b ?l)) (carrier_load ?c ?b) (increase (carrier_used ?c) 1))
  )

  ;; Move a drone
  (:action move_drone
    :parameters (?d - drone ?c - carrier ?from - location ?to - location)
    :precondition (and (robot_at ?d ?from) (carrier_at ?c ?from) (robot_has_carrier ?d ?c) (has_drone_port ?from) (has_drone_port ?to))
    :effect (and (not (carrier_at ?c ?from)) (carrier_at ?c ?to)
      (not (robot_at ?d ?from)) (robot_at ?d ?to))
  )

  ;; Unload a box from a drone
  (:action unload_from_drone_carrier
    :parameters (?d - drone ?c - carrier ?b - box ?l - location)
    :precondition (and (robot_at ?d ?l) (robot_has_carrier ?d ?c) (carrier_load ?c ?b))
    :effect (and (at_box ?b ?l) (not (carrier_load ?c ?b)) (decrease (carrier_used ?c) 1))
  )

  ;; TODO ha senso che un drone svuoti un pacco?

  ;; Unload content at a medical unit
  (:action unload_content_drone
    :parameters (?r - drone ?b - box ?m - medical_unit ?c - content)
    :precondition (and (robot_at ?r ?m) (at_box ?b ?m) (contains ?b ?c))
    :effect (and (not (contains ?b ?c)) (increase (med_unit_inventory_of ?m ?c) 1))
  )
  ;;---------------------------------------------- PATIENTS MANAGEMENT
  ;; Patient transfer
  (:action take_patient
    :parameters (?ar - accompany_robot ?w - location ?p - patient)
    :precondition (and (robot_at ?ar ?w) (free_to_accompany ?ar) (patient_at ?p ?w))
    :effect (and (not (patient_at ?p ?w)) (not (free_to_accompany ?ar)) (accompanying_pat ?p ?ar))
  )

  (:action deliver_patient
    :parameters (?ar - accompany_robot ?m - medical_unit ?p - patient)
    :precondition (and (robot_at ?ar ?m) (accompanying_pat ?p ?ar))
    :effect (and (not (accompanying_pat ?p ?ar)) (free_to_accompany ?ar) (patient_at ?p ?m))
  )
)

; problem
;; Define the healthcare logistics problem
(define (problem healthcare_problem)
  (:domain healthcare)  ;; The problem belongs to the "healthcare" domain

  ;; Define objects used in the problem
  (:objects
    central_warehouse - inventory  ;; The central warehouse where supplies are stored
    entrance location1 location2 - location  ;; Various locations in the environment
    scalpel tongue_depressor aspirin - content  ;; Different types of medical supplies
    box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 - box  ;; Boxes containing medical supplies
    delivery_robot1 delivery_robot2 - delivery_robot  ;; Delivery robots used for transporting supplies
    accompany_robot1 - accompany_robot  ;; Accompanying robot for patient transport
    drone1 drone2 - drone  ;; Drones used for airborne transport
    carrier1 carrier2 carrier3 carrier4 - carrier  ;; Carriers used for transporting multiple boxes
    rocco ciro - patient  ;; Patients who need to be transported to medical units
    medical_unit1 medical_unit2 medical_unit3 - medical_unit  ;; Medical units receiving supplies and patients
  )

  ;; Define the initial state of the environment
  (:init
    ;; Initial positions of robots, drones, and patients
    (robot_at delivery_robot1 central_warehouse)  ;; Delivery robot 1 starts at the warehouse
    ;(robot_at delivery_robot2 central_warehouse)  ;; Delivery robot 2 is commented out
    (robot_at accompany_robot1 entrance)  ;; The accompanying robot starts at the entrance
    (robot_at drone1 central_warehouse)  ;; Drone 1 starts at the warehouse
    (robot_at drone2 central_warehouse)  ;; Drone 2 starts at the warehouse
    (patient_at rocco entrance)  ;; Patient Rocco is at the entrance
    (patient_at ciro entrance)  ;; Patient Ciro is at the entrance
    
    ;; Accompanying robot status
    (free_to_accompany accompany_robot1)  ;; The accompanying robot is initially available
    
    ;; Initial positions of boxes
    (at_box box1 central_warehouse)
    (at_box box2 central_warehouse)
    (at_box box3 central_warehouse)
    (at_box box4 central_warehouse)
    (at_box box5 central_warehouse)
    (at_box box6 central_warehouse)
    (at_box box7 central_warehouse)
    (at_box box8 central_warehouse)
    (at_box box9 central_warehouse)
    (at_box box10 central_warehouse)

    ;; Initial positions of carriers and their assignments
    (carrier_at carrier1 central_warehouse)
    (carrier_at carrier2 central_warehouse)
    (carrier_at carrier3 central_warehouse)
    (carrier_at carrier4 central_warehouse)

    (robot_has_carrier delivery_robot1 carrier1)  ;; Delivery robot 1 has carrier 1
    (robot_has_carrier delivery_robot2 carrier2)  ;; Delivery robot 2 has carrier 2
    (robot_has_carrier drone1 carrier3)  ;; Drone 1 has carrier 3

    ;; Carrier capacities
    (= (carrier_capacity carrier1) 3)  ;; Carrier 1 can hold 3 boxes
    (= (carrier_capacity carrier2) 2)  ;; Carrier 2 can hold 2 boxes
    (= (carrier_capacity carrier3) 2)  ;; Carrier 3 can hold 2 boxes
    (= (carrier_capacity carrier4) 5)  ;; Carrier 4 can hold 5 boxes

    ;; Initial carrier usage (all are empty at the start)
    (= (carrier_used carrier1) 0)
    (= (carrier_used carrier2) 0)
    (= (carrier_used carrier3) 0)
    (= (carrier_used carrier4) 0)

    ;; Initial inventory at medical units
    (= (med_unit_inventory_of medical_unit1 aspirin) 0)
    (= (med_unit_inventory_of medical_unit1 scalpel) 0)
    (= (med_unit_inventory_of medical_unit1 tongue_depressor) 0)

    (= (med_unit_inventory_of medical_unit2 aspirin) 0)
    (= (med_unit_inventory_of medical_unit2 scalpel) 0)
    (= (med_unit_inventory_of medical_unit2 tongue_depressor) 0)

    ;; Define the contents of each box
    (contains box1 aspirin)
    (contains box2 aspirin)
    (contains box3 aspirin)
    (contains box4 aspirin)
    (contains box5 aspirin)
    (contains box6 scalpel)
    (contains box7 scalpel)
    (contains box8 tongue_depressor)
    (contains box9 tongue_depressor)
    (contains box10 tongue_depressor)
    
    ;; Define bidirectional connections between locations
    (connected central_warehouse location1)
    (connected location1 central_warehouse)

    (connected location1 location2)
    (connected location2 location1)

    (connected location1 medical_unit2)
    (connected medical_unit2 location1)

    (connected location2 medical_unit1)
    (connected medical_unit1 location2)
    
    (connected entrance location2)
    (connected location2 entrance)
    
    ;; Locations with drone ports
    (has_drone_port medical_unit1)
    (has_drone_port medical_unit2)
    (has_drone_port central_warehouse)
  )

  ;; Define the goal conditions
  (:goal
    (and
      ;; Required inventory levels at medical units
      (= 3 (med_unit_inventory_of medical_unit1 aspirin))  ;; Medical unit 1 needs 3 aspirin
      (= 2 (med_unit_inventory_of medical_unit1 scalpel))  ;; Medical unit 1 needs 2 scalpels
      (= 0 (med_unit_inventory_of medical_unit1 tongue_depressor))  ;; No tongue depressors needed
      
      (= 1 (med_unit_inventory_of medical_unit2 aspirin))  ;; Medical unit 2 needs 1 aspirin
      (= 0 (med_unit_inventory_of medical_unit2 scalpel))  ;; No scalpels needed
      (= 3 (med_unit_inventory_of medical_unit2 tongue_depressor))  ;; Medical unit 2 needs 3 tongue depressors

      ;; Patients must reach their designated medical units
      (patient_at rocco medical_unit1)  ;; Patient Rocco must arrive at medical unit 1
      (patient_at ciro medical_unit2)  ;; Patient Ciro must arrive at medical unit 2
    )
  )
)

; plan
1. (load_to_drone_carrier drone1 box3 carrier3 central_warehouse)
   deleted: (at_box box3 central_warehouse)
   added: (carrier_load carrier3 box3)
   changed: (carrier_used carrier3) from 0 to 1
   goals met: 2 of 8
2. (load_to_drone_carrier drone1 box10 carrier3 central_warehouse)
   deleted: (at_box box10 central_warehouse)
   added: (carrier_load carrier3 box10)
   changed: (carrier_used carrier3) from 1 to 2
   goals met: 2 of 8
3. (move_with_carrier delivery_robot1 carrier1 central_warehouse location1)
   deleted: (carrier_at carrier1 central_warehouse) (robot_at delivery_robot1 central_warehouse)
   added: (carrier_at carrier1 location1) (robot_at delivery_robot1 location1)
   goals met: 2 of 8
4. (take_patient accompany_robot1 entrance rocco)
   deleted: (patient_at rocco entrance) (free_to_accompany accompany_robot1)
   added: (accompanying_pat rocco accompany_robot1)
   goals met: 2 of 8
5. (move_drone drone1 carrier3 central_warehouse medical_unit1)
   deleted: (carrier_at carrier3 central_warehouse) (robot_at drone1 central_warehouse)
   added: (carrier_at carrier3 medical_unit1) (robot_at drone1 medical_unit1)
   goals met: 2 of 8
6. (unload_from_drone_carrier drone1 carrier3 box3 medical_unit1)
   deleted: (carrier_load carrier3 box3)
   added: (at_box box3 medical_unit1)
   changed: (carrier_used carrier3) from 2 to 1
   goals met: 2 of 8
7. (move_drone drone1 carrier3 medical_unit1 central_warehouse)
   deleted: (carrier_at carrier3 medical_unit1) (robot_at drone1 medical_unit1)
   added: (carrier_at carrier3 central_warehouse) (robot_at drone1 central_warehouse)
   goals met: 2 of 8
8. (load_to_drone_carrier drone1 box6 carrier3 central_warehouse)
   deleted: (at_box box6 central_warehouse)
   added: (carrier_load carrier3 box6)
   changed: (carrier_used carrier3) from 1 to 2
   goals met: 2 of 8
9. (move_drone drone1 carrier3 central_warehouse medical_unit2)
   deleted: (carrier_at carrier3 central_warehouse) (robot_at drone1 central_warehouse)
   added: (carrier_at carrier3 medical_unit2) (robot_at drone1 medical_unit2)
   goals met: 2 of 8
10. (unload_from_drone_carrier drone1 carrier3 box10 medical_unit2)
   deleted: (carrier_load carrier3 box10)
   added: (at_box box10 medical_unit2)
   changed: (carrier_used carrier3) from 2 to 1
   goals met: 2 of 8
11. (move_drone drone1 carrier3 medical_unit2 medical_unit1)
   deleted: (carrier_at carrier3 medical_unit2) (robot_at drone1 medical_unit2)
   added: (carrier_at carrier3 medical_unit1) (robot_at drone1 medical_unit1)
   goals met: 2 of 8
12. (unload_from_drone_carrier drone1 carrier3 box6 medical_unit1)
   deleted: (carrier_load carrier3 box6)
   added: (at_box box6 medical_unit1)
   changed: (carrier_used carrier3) from 1 to 0
   goals met: 2 of 8
13. (move_with_carrier delivery_robot1 carrier1 location1 medical_unit2)
   deleted: (carrier_at carrier1 location1) (robot_at delivery_robot1 location1)
   added: (carrier_at carrier1 medical_unit2) (robot_at delivery_robot1 medical_unit2)
   goals met: 2 of 8
14. (move accompany_robot1 entrance location2)
   deleted: (robot_at accompany_robot1 entrance)
   added: (robot_at accompany_robot1 location2)
   goals met: 2 of 8
15. (move accompany_robot1 location2 medical_unit1)
   deleted: (robot_at accompany_robot1 location2)
   added: (robot_at accompany_robot1 medical_unit1)
   goals met: 2 of 8
16. (deliver_patient accompany_robot1 medical_unit1 rocco)
   deleted: (accompanying_pat rocco accompany_robot1)
   added: (free_to_accompany accompany_robot1) (patient_at rocco medical_unit1)
   goals met: 3 of 8
17. (move accompany_robot1 medical_unit1 location2)
   deleted: (robot_at accompany_robot1 medical_unit1)
   added: (robot_at accompany_robot1 location2)
   goals met: 3 of 8
18. (move accompany_robot1 location2 entrance)
   deleted: (robot_at accompany_robot1 location2)
   added: (robot_at accompany_robot1 entrance)
   goals met: 3 of 8
19. (take_patient accompany_robot1 entrance ciro)
   deleted: (patient_at ciro entrance) (free_to_accompany accompany_robot1)
   added: (accompanying_pat ciro accompany_robot1)
   goals met: 3 of 8
20. (move accompany_robot1 entrance location2)
   deleted: (robot_at accompany_robot1 entrance)
   added: (robot_at accompany_robot1 location2)
   goals met: 3 of 8
21. (move accompany_robot1 location2 location1)
   deleted: (robot_at accompany_robot1 location2)
   added: (robot_at accompany_robot1 location1)
   goals met: 3 of 8
22. (move accompany_robot1 location1 medical_unit2)
   deleted: (robot_at accompany_robot1 location1)
   added: (robot_at accompany_robot1 medical_unit2)
   goals met: 3 of 8
23. (deliver_patient accompany_robot1 medical_unit2 ciro)
   deleted: (accompanying_pat ciro accompany_robot1)
   added: (free_to_accompany accompany_robot1) (patient_at ciro medical_unit2)
   goals met: 4 of 8
24. (unload_content_drone drone1 box3 medical_unit1 aspirin)
   deleted: (contains box3 aspirin)
   changed: (med_unit_inventory_of medical_unit1 aspirin) from 0 to 1
   goals met: 4 of 8
25. (move_drone drone1 carrier3 medical_unit1 central_warehouse)
   deleted: (carrier_at carrier3 medical_unit1) (robot_at drone1 medical_unit1)
   added: (carrier_at carrier3 central_warehouse) (robot_at drone1 central_warehouse)
   goals met: 4 of 8
26. (load_to_drone_carrier drone1 box4 carrier3 central_warehouse)
   deleted: (at_box box4 central_warehouse)
   added: (carrier_load carrier3 box4)
   changed: (carrier_used carrier3) from 0 to 1
   goals met: 4 of 8
27. (move_drone drone1 carrier3 central_warehouse medical_unit1)
   deleted: (carrier_at carrier3 central_warehouse) (robot_at drone1 central_warehouse)
   added: (carrier_at carrier3 medical_unit1) (robot_at drone1 medical_unit1)
   goals met: 4 of 8
28. (move_drone drone1 carrier3 medical_unit1 medical_unit2)
   deleted: (carrier_at carrier3 medical_unit1) (robot_at drone1 medical_unit1)
   added: (carrier_at carrier3 medical_unit2) (robot_at drone1 medical_unit2)
   goals met: 4 of 8
29. (unload_from_drone_carrier drone1 carrier3 box4 medical_unit2)
   deleted: (carrier_load carrier3 box4)
   added: (at_box box4 medical_unit2)
   changed: (carrier_used carrier3) from 1 to 0
   goals met: 4 of 8
30. (move_drone drone1 carrier3 medical_unit2 central_warehouse)
   deleted: (carrier_at carrier3 medical_unit2) (robot_at drone1 medical_unit2)
   added: (carrier_at carrier3 central_warehouse) (robot_at drone1 central_warehouse)
   goals met: 4 of 8
31. (load_to_drone_carrier drone1 box2 carrier3 central_warehouse)
   deleted: (at_box box2 central_warehouse)
   added: (carrier_load carrier3 box2)
   changed: (carrier_used carrier3) from 0 to 1
   goals met: 4 of 8
32. (move_drone drone1 carrier3 central_warehouse medical_unit1)
   deleted: (carrier_at carrier3 central_warehouse) (robot_at drone1 central_warehouse)
   added: (carrier_at carrier3 medical_unit1) (robot_at drone1 medical_unit1)
   goals met: 4 of 8
33. (unload_from_drone_carrier drone1 carrier3 box2 medical_unit1)
   deleted: (carrier_load carrier3 box2)
   added: (at_box box2 medical_unit1)
   changed: (carrier_used carrier3) from 1 to 0
   goals met: 4 of 8
34. (unload_content delivery_robot1 box4 medical_unit2 aspirin)
   deleted: (contains box4 aspirin)
   changed: (med_unit_inventory_of medical_unit2 aspirin) from 0 to 1
   goals met: 5 of 8
35. (unload_content delivery_robot1 box10 medical_unit2 tongue_depressor)
   deleted: (contains box10 tongue_depressor)
   changed: (med_unit_inventory_of medical_unit2 tongue_depressor) from 0 to 1
   goals met: 5 of 8
36. (move_drone drone1 carrier3 medical_unit1 central_warehouse)
   deleted: (carrier_at carrier3 medical_unit1) (robot_at drone1 medical_unit1)
   added: (carrier_at carrier3 central_warehouse) (robot_at drone1 central_warehouse)
   goals met: 5 of 8
37. (load_to_drone_carrier drone1 box8 carrier3 central_warehouse)
   deleted: (at_box box8 central_warehouse)
   added: (carrier_load carrier3 box8)
   changed: (carrier_used carrier3) from 0 to 1
   goals met: 5 of 8
38. (move_drone drone1 carrier3 central_warehouse medical_unit2)
   deleted: (carrier_at carrier3 central_warehouse) (robot_at drone1 central_warehouse)
   added: (carrier_at carrier3 medical_unit2) (robot_at drone1 medical_unit2)
   goals met: 5 of 8
39. (unload_from_drone_carrier drone1 carrier3 box8 medical_unit2)
   deleted: (carrier_load carrier3 box8)
   added: (at_box box8 medical_unit2)
   changed: (carrier_used carrier3) from 1 to 0
   goals met: 5 of 8
40. (move_drone drone1 carrier3 medical_unit2 medical_unit1)
   deleted: (carrier_at carrier3 medical_unit2) (robot_at drone1 medical_unit2)
   added: (carrier_at carrier3 medical_unit1) (robot_at drone1 medical_unit1)
   goals met: 5 of 8
41. (unload_content_drone drone1 box6 medical_unit1 scalpel)
   deleted: (contains box6 scalpel)
   changed: (med_unit_inventory_of medical_unit1 scalpel) from 0 to 1
   goals met: 5 of 8
42. (move_drone drone1 carrier3 medical_unit1 central_warehouse)
   deleted: (carrier_at carrier3 medical_unit1) (robot_at drone1 medical_unit1)
   added: (carrier_at carrier3 central_warehouse) (robot_at drone1 central_warehouse)
   goals met: 5 of 8
43. (load_to_drone_carrier drone1 box7 carrier3 central_warehouse)
   deleted: (at_box box7 central_warehouse)
   added: (carrier_load carrier3 box7)
   changed: (carrier_used carrier3) from 0 to 1
   goals met: 5 of 8
44. (move_drone drone1 carrier3 central_warehouse medical_unit1)
   deleted: (carrier_at carrier3 central_warehouse) (robot_at drone1 central_warehouse)
   added: (carrier_at carrier3 medical_unit1) (robot_at drone1 medical_unit1)
   goals met: 5 of 8
45. (unload_from_drone_carrier drone1 carrier3 box7 medical_unit1)
   deleted: (carrier_load carrier3 box7)
   added: (at_box box7 medical_unit1)
   changed: (carrier_used carrier3) from 1 to 0
   goals met: 5 of 8
46. (unload_content_drone drone1 box7 medical_unit1 scalpel)
   deleted: (contains box7 scalpel)
   changed: (med_unit_inventory_of medical_unit1 scalpel) from 1 to 2
   goals met: 6 of 8
47. (unload_content_drone drone1 box2 medical_unit1 aspirin)
   deleted: (contains box2 aspirin)
   changed: (med_unit_inventory_of medical_unit1 aspirin) from 1 to 2
   goals met: 6 of 8
48. (move_drone drone1 carrier3 medical_unit1 central_warehouse)
   deleted: (carrier_at carrier3 medical_unit1) (robot_at drone1 medical_unit1)
   added: (carrier_at carrier3 central_warehouse) (robot_at drone1 central_warehouse)
   goals met: 6 of 8
49. (load_to_drone_carrier drone1 box5 carrier3 central_warehouse)
   deleted: (at_box box5 central_warehouse)
   added: (carrier_load carrier3 box5)
   changed: (carrier_used carrier3) from 0 to 1
   goals met: 6 of 8
50. (move_drone drone1 carrier3 central_warehouse medical_unit1)
   deleted: (carrier_at carrier3 central_warehouse) (robot_at drone1 central_warehouse)
   added: (carrier_at carrier3 medical_unit1) (robot_at drone1 medical_unit1)
   goals met: 6 of 8
51. (unload_from_drone_carrier drone1 carrier3 box5 medical_unit1)
   deleted: (carrier_load carrier3 box5)
   added: (at_box box5 medical_unit1)
   changed: (carrier_used carrier3) from 1 to 0
   goals met: 6 of 8
52. (unload_content_drone drone1 box5 medical_unit1 aspirin)
   deleted: (contains box5 aspirin)
   changed: (med_unit_inventory_of medical_unit1 aspirin) from 2 to 3
   goals met: 7 of 8
53. (unload_content delivery_robot1 box8 medical_unit2 tongue_depressor)
   deleted: (contains box8 tongue_depressor)
   changed: (med_unit_inventory_of medical_unit2 tongue_depressor) from 1 to 2
   goals met: 7 of 8
54. (move_drone drone1 carrier3 medical_unit1 central_warehouse)
   deleted: (carrier_at carrier3 medical_unit1) (robot_at drone1 medical_unit1)
   added: (carrier_at carrier3 central_warehouse) (robot_at drone1 central_warehouse)
   goals met: 7 of 8
55. (load_to_drone_carrier drone1 box9 carrier3 central_warehouse)
   deleted: (at_box box9 central_warehouse)
   added: (carrier_load carrier3 box9)
   changed: (carrier_used carrier3) from 0 to 1
   goals met: 7 of 8
56. (move_drone drone1 carrier3 central_warehouse medical_unit2)
   deleted: (carrier_at carrier3 central_warehouse) (robot_at drone1 central_warehouse)
   added: (carrier_at carrier3 medical_unit2) (robot_at drone1 medical_unit2)
   goals met: 7 of 8
57. (unload_from_drone_carrier drone1 carrier3 box9 medical_unit2)
   deleted: (carrier_load carrier3 box9)
   added: (at_box box9 medical_unit2)
   changed: (carrier_used carrier3) from 1 to 0
   goals met: 7 of 8
58. (unload_content delivery_robot1 box9 medical_unit2 tongue_depressor)
   deleted: (contains box9 tongue_depressor)
   changed: (med_unit_inventory_of medical_unit2 tongue_depressor) from 2 to 3
   goals met: 8 of 8
